<details><summary>Digger run report at 2023-12-23 18:56:18 (UTC)</summary>
    <details><summary>Plan for <b>juanPablo06/poc-terraform#production</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_iam_role.iam_for_lambda will be updated in-place
  ~ resource "aws_iam_role" "iam_for_lambda" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRole" -> [
                          + "sts:AssumeRole",
                          + "sqs:SendMessage",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "iam_for_lambda"
        name                  = "iam_for_lambda"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_lambda_code_signing_config.default will be created
  + resource "aws_lambda_code_signing_config" "default" {
      + arn           = (known after apply)
      + config_id     = (known after apply)
      + description   = "test"
      + id            = (known after apply)
      + last_modified = (known after apply)

      + allowed_publishers {
          + signing_profile_version_arns = (known after apply)
        }

      + policies {
          + untrusted_artifact_on_deployment = "Warn"
        }
    }

  # aws_lambda_function.test_lambda will be updated in-place
  ~ resource "aws_lambda_function" "test_lambda" {
      + code_signing_config_arn        = (known after apply)
        id                             = "lambda_function_name"
      ~ reserved_concurrent_executions = -1 -> 1
        tags                           = {}
        # (21 unchanged attributes hidden)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      - environment {
          - variables = {
              - "foo" = "bar"
            } -> null
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-6f64c068",
            ]
          + subnet_ids                  = [
              + "subnet-028c844f",
              + "subnet-15d2aa73",
              + "subnet-367d4038",
              + "subnet-534e0872",
              + "subnet-8e1450d1",
              + "subnet-cda12efc",
            ]
        }

        # (1 unchanged block hidden)
    }

  # aws_signer_signing_profile.default will be created
  + resource "aws_signer_signing_profile" "default" {
      + arn                   = (known after apply)
      + id                    = (known after apply)
      + name                  = "test"
      + name_prefix           = (known after apply)
      + platform_display_name = (known after apply)
      + platform_id           = "AWSLambda-SHA384-ECDSA"
      + revocation_record     = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)
      + version_arn           = (known after apply)

      + signature_validity_period {
          + type  = "DAYS"
          + value = 180
        }
    }

  # aws_sqs_queue.test_lambda_dl_queue will be created
  + resource "aws_sqs_queue" "test_lambda_dl_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "test_lambda_dl_queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>

<details><summary>Plan for <b>juanPablo06/poc-terraform#production</b></summary>
  
```terraform
No changes in terraform plan
  ```
</details>

</details>